In [1]:
import pandas as pd
import numpy as np

In [2]:
cars = pd.Series(['BMW','Audi','Mercedes'], index=['a','b','c'])
cars

a         BMW
b        Audi
c    Mercedes
dtype: object

In [3]:
cars = cars.drop('a')
cars

b        Audi
c    Mercedes
dtype: object

In [4]:
cars_df = pd.DataFrame(np.random.randn(9).reshape(3,3), index=['BMW','Audi','Mercedes'], columns=['test1','test2','test3'])
cars_df

             test1     test2     test3
BMW       1.731902  0.384540 -0.584115
Audi      0.918631 -1.201703 -0.995782
Mercedes -0.662589 -0.389712 -0.908192

In [5]:
cars_df = cars_df.drop('BMW')        # to drop a row, specify index
cars_df

             test1     test2     test3
Audi      0.918631 -1.201703 -0.995782
Mercedes -0.662589 -0.389712 -0.908192

In [6]:
cars_df = cars_df.drop('test1', axis=1)       # for column, axis=1
cars_df

             test2     test3
Audi     -1.201703 -0.995782
Mercedes -0.389712 -0.908192